ErikHurum/S2Prog/IO/Old/ANZB – ATmega1280/Src/RS485.c

/****************************************************************************************
/ Uart communication to external ADcards
/
***************************************************************************************/

#include "iom1280.h"
#include "stdio.h"
#include "math.h"
#include "externals.h"
#include "version.h"
#include "stdlib.h"
//#include "string.h"



/************************************************ *************************
*   (This is a timer calback)
*  Timout timer UART 0
*
*************************************************************************/
void TimoutUART0(void) {

    U0_MCR &= ~RTS;      // set RTS off
}

/*************************************************************************
*   (This is a timer calback)
*  Timout timer UART 1
*
*************************************************************************/
void TimoutUART1(void) {

    U1_MCR &= ~RTS;       // set RTS off
}


/*************************************************************************
*   (This is a task)
*  Usart handler UART send request
*
*************************************************************************/
void ExtRS485Ctl(void) {
    char SeqCnt = 0;
    char PowerOnTimer = POWER_ON_CNT;                    // do not make a unwanted power on sequence in the starting phase
    char EventStatus;
    char AskMD[2];

    
    Init16552(0, 9600);                                      // Init UART channel 0
    Init16552(1, 9600);                                      // Init UART channel 1
    
    TData.RS4.PortUsed = ReadEEPROMByte(EEPROM_PORTSETUP);   // Get setup from EEPROM
    TData.RS4.SensorType[0] = ReadEEPROMByte(EEPROM_PORTSETUP + 1);
    TData.RS4.SensorType[1] = ReadEEPROMByte(EEPROM_PORTSETUP + 2);

    TData.RS4.ToTargetBuffer[0][0] = false;
    TData.RS4.ToTargetBuffer[1][0] = false;
    TData.RS4.FromTargetBuffer[0][0] = false;
    TData.RS4.FromTargetBuffer[1][0] = false;
    
    
    for (char i = 0; i < 8; i++) {
        SetBit(PORTC, (TData.RS4.PortUsed & (0x01 << i)));      // Switch on power
        OS_Delay(100);
    }
    OS_Delay(UART_START_DELAY);                               // Waiting for target startup
    
    while (1) {
        for (PortPair = 0; PortPair < 4; PortPair++) {        // loop through all ports
            if (UART16552[0].RxFaultCnt > MAX_16552_FAIL) {
                EmptyRxBuf16552(0);                            // Empty UART channel 0
            }
            if (UART16552[1].RxFaultCnt > MAX_16552_FAIL) {
                EmptyRxBuf16552(1);                            // Empty UART channel 1
            }
            if (PowerOnTimer < POWER_ON_CNT) {
                if (++PowerOnTimer >= POWER_ON_CNT) {          // check if time to switch on power
                    SetRS4Port();                                // and set power on ports
                }
            }
            SetBit(PORTE, 0xf0);
            ClrBit(PORTE, (0x10 << PortPair) & 0xf0);           // set mux port
            if ((TData.RS4.PortUsed >> PortPair) & 0x01) {      // sensor on port 0?
                UART16552[0].TxFirst = 6;                       // Start packet build at pos.
                char SnsType = (TData.RS4.SensorType[0] >> (2 * PortPair)) & 0x3;
                switch (SnsType) {
                case 0x01:    //Water ingress??
                    switch (SeqCnt) {
                    case 0:
                        Uart_BuildReqWISCardStatus(0);          //Card status
                        break;
                    case 20:
                        if ((TData.RS4.FromTargetBuffer[0][0] == false) && (TData.RS4.EEPROMPortpair[0] == PortPair)) { // buffer ready
                            Uart_BuildReqWISXData(0, 115);            // Request serial no
                            if (++TData.RS4.EEPROMPortpair[0] >= 4) {
                                TData.RS4.EEPROMPortpair[0] = 0;
                            }
                        } else {
                            Uart_BuildReqWISData(0);                //WIS data
                        }
                        break;
                    default:
                        Uart_BuildReqWISData(0);                //WIS data
                        break;
                    }
                    break;
                case 0x02: // Radar??
                    switch (SeqCnt) {
                    case 20:
                        if ((TData.RS4.FromTargetBuffer[0][0] == false) && (TData.RS4.EEPROMPortpair[0] == PortPair)) { // buffer ready
                            if (++TData.RS4.EEPROMPortpair[0] >= 4) {
                                TData.RS4.EEPROMPortpair[0] = 0;
                            }
                        }
                        // Fall through and send the request
                    default:
                        Uart_BuildReqRadarData(0);          // Radar data
                        break;
                    case 0:
                        Uart_BuildReqRadarInfo(0);          //Radar Information
                        break;
                    }
                    break;
                case 0x00:  // AN-SGCNV
                    if ((TData.RS4.ToTargetBuffer[0][0] == true) && // Data ready for this AD card
                        (TData.RS4.ToTargetBuffer[0][1] == PortPair)) {
                        Uart_BuildSndData(0);                       // add data to AD card package
                        Uart_BuildReqConfig(0);                 //Config data, cmd 17
                        AskMD[0] = false;
                    } else {
                        AskMD[0] = true;
                    }
                    if (SeqCnt == 0) {
                        Uart_BuildReqCardStatus(0);             //Card status, cmd 27
                    } else if (SeqCnt == 5) {
                        Uart_BuildReqR16552(0);                 //Raw data, cmd 13
                    } else if (SeqCnt == 10) {
                        Uart_BuildReqConfig(0);                 //Config data, cmd 17
                    } else if (SeqCnt == 15) {
                        Uart_BuildReqC16552(0);                 //Cal data, cmd 16
                    } else if (SeqCnt == 20) {
                        if ((TData.RS4.FromTargetBuffer[0][0] == false) && (TData.RS4.EEPROMPortpair[0] == PortPair)) { // buffer ready
                            Uart_BuildReqEEPROMData(0);             //EEpromdata cmd, 24
                            if ((TData.RS4.EEPROMADChannel[0] += 2) > 14) { //Next channel
                                TData.RS4.EEPROMADChannel[0] = 0;
                                if (++TData.RS4.EEPROMPortpair[0] >= 4) {
                                    TData.RS4.EEPROMPortpair[0] = 0;
                                }
                            }
                        } else if (AskMD[0] == true) {
                            Uart_BuildReqM16552(0);                 //Measure data, cmd 10
                        }
                    } else if (AskMD[0] == true) {
                        Uart_BuildReqM16552(0);                 //Measure data, cmd 10
                    }
                    break;
                }
                Uart_BuildTail16552(0);
            } else {
                if (TData.RS4.EEPROMPortpair[0] == PortPair) {
                    if (++TData.RS4.EEPROMPortpair[0] >= 4) {  // make sure that the EEPROM reading is not stopped
                        TData.RS4.EEPROMPortpair[0] = 0;
                    }
                }
            }
            if ((TData.RS4.PortUsed >> (PortPair + 4)) & 0x01) {              // sensor on port 1?
                UART16552[1].TxFirst = 6;                       // Start at
                char SnsType = ((TData.RS4.SensorType[1] >> (2 * PortPair))) & 0x3;
                switch (SnsType) {
                case 0x01:    //Water ingress??
                    switch (SeqCnt) {
                    case 0:
                        Uart_BuildReqWISCardStatus(1);          //Card status
                        break;
                    case 20:
                        if ((TData.RS4.FromTargetBuffer[1][0] == false) && (TData.RS4.EEPROMPortpair[1] == PortPair)) { // buffer ready
                            Uart_BuildReqWISXData(1, 115);            // Request serial no
                            if (++TData.RS4.EEPROMPortpair[1] >= 4) {
                                TData.RS4.EEPROMPortpair[1] = 0;
                            }
                        } else {
                            Uart_BuildReqWISData(1);                //WIS data
                        }
                        break;
                    default:
                        Uart_BuildReqWISData(1);                //WIS data
                        break;
                    }
                    break;
                case 0x02:    // Radar??
                    switch (SeqCnt) {
                    case 20:
                        if ((TData.RS4.FromTargetBuffer[1][0] == false) && (TData.RS4.EEPROMPortpair[1] == PortPair)) { // buffer ready
                            if (++TData.RS4.EEPROMPortpair[1] >= 4) {
                                TData.RS4.EEPROMPortpair[1] = 0;
                            }
                        }
                        // Fall through and send the request
                    default:
                        Uart_BuildReqRadarData(1);          // Radar data
                        break;
                    case 0:
                        Uart_BuildReqRadarInfo(1);          //Radar Information
                        break;
                    }
                    break;
                case 0x00:  // AN-SGCNV
                    if ((TData.RS4.ToTargetBuffer[1][0] == true) && // Data ready for this AD card
                        (TData.RS4.ToTargetBuffer[1][1] == (PortPair + 4))) {
                        Uart_BuildSndData(1);                       // add data to AD card package
                        Uart_BuildReqConfig(1);                 //Config data, cmd 17
                        AskMD[1] = false;
                    } else {
                        AskMD[1] = true;
                    }
                    if (SeqCnt == 0) {
                        Uart_BuildReqCardStatus(1);             //Card status, cmd 27
                    } else if (SeqCnt == 5) {
                        Uart_BuildReqR16552(1);                 //Raw data cmd, 13
                    } else if (SeqCnt == 10) {
                        Uart_BuildReqConfig(1);                 //Config data, cmd 17
                    } else if (SeqCnt == 15) {
                        Uart_BuildReqC16552(1);                 //Cal data  cmd, 16
                    } else if (SeqCnt == 20) {
                        if ((TData.RS4.FromTargetBuffer[1][0] == false) && (TData.RS4.EEPROMPortpair[1] == PortPair)) { // buffer ready
                            Uart_BuildReqEEPROMData(1);             //EEpromdata cmd, 24
                            if ((TData.RS4.EEPROMADChannel[1] += 2) > 14) { //Next channel
                                TData.RS4.EEPROMADChannel[1] = 0;
                                if (++TData.RS4.EEPROMPortpair[1] >= 4) {
                                    TData.RS4.EEPROMPortpair[1] = 0;
                                }
                            }
                        } else if (AskMD[1] == true) {
                            Uart_BuildReqM16552(1);                 //Measure data, cmd 10
                        }
                    } else if (AskMD[1] == true) {
                        Uart_BuildReqM16552(1);                 //Measure data, cmd 10
                    }
                    break;
                }
                Uart_BuildTail16552(1);
            } else {
                if (TData.RS4.EEPROMPortpair[1] == PortPair) {
                    if (++TData.RS4.EEPROMPortpair[1] >= 4) {  // make sure that the EEPROM reading is not stopped
                        TData.RS4.EEPROMPortpair[1] = 0;
                    }
                }
            }
            EventStatus = OS_WaitEventTimed(1, 1000);              // Wait for ready to send next
            if (EventStatus & 0x02) {
                if (PowerOnTimer >= POWER_ON_CNT) {
                    PowerOnTimer = 0;                              // and start over again
                }
            }
        }
        if (++SeqCnt > 20) {              //  all request within 20 x 2 sec.
            SeqCnt = 0;
        }
    }
}


/*************************************************************************
*   (This is a task)
*  Usart handler UART receive data
*
*************************************************************************/
void ExtRS485Rec(void) {

    char portresp;

    OS_Delay(UART_START_DELAY + 800);           // Waiting for target startup and power on sequence

    while (1) {
        OS_Delay(499);                          // wait for answer and correct the speed (.5 * 4 = 2 sec update)
        portresp = OS_WaitEventTimed(3, 1);     // Wait for receive from both channels
        if (portresp & 0x01) {                  // answer on ch 0
            Usart16552CheckPackage(0);         // handle incomming package
            TData.RS4.FailCnt[PortPair][0] = 0; // Reset counter
            TData.RS4.IOUnitStatus[PortPair] &= ~COMFAIL_BIT; // No error
            UART16552[0].RxFaultCnt = 0;          // OK package on 16552 channel
        } else {
            UART16552[0].RxFaultCnt++;          // Fault in package on 16552 channel
            TData.RS4.FailCnt[PortPair][1]++;      // no answer total counter
            if (TData.RS4.FailCnt[PortPair][0]++ > FAILCNT_ERROR) {
                TData.RS4.IOUnitStatus[PortPair] |= COMFAIL_BIT;      // report fault
            }
            if ((TData.RS4.PortUsed >> PortPair) & 0x01) {              // sensor on port 0?
                if ((TData.RS4.FailCnt[PortPair][0] & 0x0007) == 0x0004) {   //check if powqer shall be switched off
                    ClrBit(PORTC, (0x01 << PortPair));            // Switch off power
                    OS_SignalEvent(2, &TCB_RS485Ctl);
                }
            }
        }
        if (portresp & 0x02) {                  // answer on ch 1
            Usart16552CheckPackage(1);         // handle incomming package
            TData.RS4.FailCnt[PortPair + 4][0] = 0; // Reset counter
            TData.RS4.IOUnitStatus[PortPair + 4] &= ~COMFAIL_BIT; // No error
            UART16552[1].RxFaultCnt = 0;          // OK package on 16552 channel
        } else {
            UART16552[1].RxFaultCnt++;          // Fault in package on 16552 channel
            TData.RS4.FailCnt[PortPair + 4][1]++;      // no answer
            if (TData.RS4.FailCnt[PortPair + 4][0]++ > FAILCNT_ERROR) {
                TData.RS4.IOUnitStatus[PortPair + 4] |= COMFAIL_BIT;      // report fault
            }
            if ((TData.RS4.PortUsed >> (PortPair + 4)) & 0x01) {              // sensor on port 1?
                if ((TData.RS4.FailCnt[PortPair + 4][0] & 0x0007) == 0x0004) {   //check if powqer shall be switched off
                    ClrBit(PORTC, (0x01 << (PortPair + 4)));            // Switch off power
                    OS_SignalEvent(2, &TCB_RS485Ctl);
                }
            }
        }
        OS_SignalEvent(1, &TCB_RS485Ctl);
    }
}

/*************************************************************************
*
*  Set ports on or off
*
*************************************************************************/
void SetRS4Port(void) {

    PORTC = TData.RS4.PortUsed;

