ErikHurum/S2Prog/IO/Old/ANZB – ATmega1280/Src/RS485.c
    Uart_BuildHeader16552(ch);                                // fist build the header

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;         // command, No more data
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;         // error

    UART16552[ch].pTxBuffer[4] = (UART16552[ch].TxFirst) >> 8;           // packet len high
    UART16552[ch].pTxBuffer[5] = UART16552[ch].TxFirst;                // correct length because stx's


    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst] = CalcDSTxChecksumUART16552(ch, UART16552[ch].TxFirst); // Get checksum
    UART16552[ch].TxFirst++;                                     // OBS!! must be inc here due
                                                                 // to ANSI standard !!!!

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANPRO1_EOT;            // End of transmission
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0x00;            //switch off transmitter delay

    UART16552[ch].TxCount = UART16552[ch].TxFirst - 1;       //bytes to send (-1 for the start byte)
    UART16552[ch].TxLast = 1;                               // sent 1 byte
    GoToSyncUART16552(ch);                                 // go to sync modus for recive
    if (ch == 0) {                                           // Turn on TXE for channel
        OS_RetriggerTimer(&TimerUART0);                    // and start timeout timer
        U0_MCR |= RTS;                                    // set RTS on
        OS_Delay(20);                                           // Wait (ms) for tx stable
        U0_THR = UART16552[ch].pTxBuffer[0];                // Send 1. byte
    } else if (ch == 1) {
        OS_RetriggerTimer(&TimerUART1);                    // and start timeout timer
        U1_MCR |= RTS;                                      // set RTS on
        OS_Delay(20);                                           // Wait (ms) for tx stable
        U1_THR = UART16552[ch].pTxBuffer[0];                  // Send 1. byte
    }
}

/*************************************************************************
*
* Build send request for system status on WIS
*
*************************************************************************/
void Uart_BuildReqWISCardStatus(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_SND_WIS_STAT;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*nob */

}

/*************************************************************************
*
* Build send request for WIS protocoler on WIS
*
*************************************************************************/
void Uart_BuildReqWISXData(char ch, char sndcmd) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_SND_WIS_XDATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                        /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = sndcmd;                 // xdata cmd

}

/*************************************************************************
*
* Build send request for measure data to Water ingress
*
*************************************************************************/
void Uart_BuildReqWISData(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_SND_WIS_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*data */

}


/*************************************************************************
*
* Build send request for GODA measurement
*
*************************************************************************/
void Uart_BuildReqRadarData(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_SND_GODA_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                        /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 // data

}

/*************************************************************************
*
* Build send request for GODA device information
*
*************************************************************************/
void Uart_BuildReqRadarInfo(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_SND_GODA_INFO;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                        /*nob */
}

/*************************************************************************
*
* Build datablock to AN-SGCNV
*
*************************************************************************/
void Uart_BuildSndData(char ch) {

    char i;

    for (i = 3; i < (TData.RS4.ToTargetBuffer[ch][2]) + 3; i++) {
        UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = TData.RS4.ToTargetBuffer[ch][i];       /*command, send data */
    }
    TData.RS4.ToTargetBuffer[ch][0] = false;            // data sent
}

/*************************************************************************
*
* Build send request for measure data to AN-SGCNV
*
*************************************************************************/
void Uart_BuildReqM16552(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_M_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*data */

}

/*************************************************************************
*
* Build send request for raw data to AN-SGCNV
*
*************************************************************************/
void Uart_BuildReqR16552(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_R_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*data */

}

/*************************************************************************
*
* Build send request for cal data to AN-SGCNV
*
*************************************************************************/
void Uart_BuildReqC16552(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_C_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*data */

