ErikHurum/S2Prog/IO/Old/ANZB – ATmega1280/Src/RS485.c
}

/*************************************************************************
*
* Build send request for system status on AN_SGCNV
*
*************************************************************************/
void Uart_BuildReqCardStatus(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_CARD_STAT;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*data */

}

/*************************************************************************
*
* Build send request for card config on AN_SGCNV
*
*************************************************************************/
void Uart_BuildReqConfig(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_CONFIG;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*nob */

}

/*************************************************************************
*
* Build send request for EEPROM data on AN_SGCNV
*
*************************************************************************/
void Uart_BuildReqEEPROMData(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_EEP_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = TData.RS4.EEPROMADChannel[ch];       /*data */

}
/*************************************************************************
*
*  Receive data on USARTs
*
*************************************************************************/
void ReceivePacketUart16552(char ch) {

    switch (UART16552[ch].RxState) {                  // check status
    case SYNC :
        // all functionallity in inerrupt routine
        break;
    case HEADER :
        if (UART16552[ch].RxLast >= 3) {             // receive header
            UART16552[ch].RxPacklen = ((UART16552[ch].pRxBuffer[2] * 256) +
                                       UART16552[ch].pRxBuffer[3]);    // Find length of package
            if ((UART16552[ch].RxPacklen < ((short)RXSIZE_UART_16552 - UART16552[ch].RxLast)) &&    /* chk. header */
                (UART16552[ch].RxPacklen >= MIN_PACK_LEN)) {
                UART16552[ch].RxState = RECEIVE;       // Header ok og to data receive state
                UART16552[ch].RxCount = UART16552[ch].RxLast + 1;    // Set receivcounter
            } else {
                GoToSyncUART16552(ch);                                    // go to sync modus for recive
            }
        }
        break;
    case RECEIVE :
        if (++UART16552[ch].RxCount >= UART16552[ch].RxPacklen) {
            if ((UART16552[ch].pRxBuffer[UART16552[ch].RxPacklen - 1]) == ANPRO1_EOT) {
                if (CalcDSRxChecksum16552(ch)) {
                    if (UART16552[ch].pRxBuffer[0] == MY_SGCNV_ADDR) {     // reply from AN_SGCNV
                        UART16552[ch].RxState = HANDLE;                   // Package OK
                        if (ch == 0) {
                            OS_SignalEvent(1, &TCB_RS485Rec);
                        } else if (ch == 1) {
                            OS_SignalEvent(2, &TCB_RS485Rec);
                        }
                    } else {
                        GoToSyncUART16552(ch);                             // go to sync modus for recive
                    }
                } else {
                    GoToSyncUART16552(ch);                                // go to sync modus for recive
                }
            } else {
                GoToSyncUART16552(ch);                                    // go to sync modus for recive
            }
        }
        break;
    case HANDLE :
        break;
    default :
        GoToSyncUART16552(ch);                                            // go to sync modus for recive
        break;
    }                                                           // end switch
    if (++UART16552[ch].RxLast >= RXSIZE_UART_16552) {                     // check pointer
        UART16552[ch].RxLast = 0;                                     // reset pointer
    }
}


/*************************************************************************
*
* Calculate tx checksum for Dallas Semiconductor one-wire CRC
*
*************************************************************************/
char CalcDSTxChecksumUART16552(char ch, unsigned short len) {

    unsigned short cnt;
    unsigned char csum;

    csum = 0;
    for (cnt = 2; cnt < len; cnt++) {
        csum = crc[csum ^ UART16552[ch].pTxBuffer[cnt]];
    }
    return csum;
}

/*************************************************************************
*
* Calculate rx checksum for Dallas Semiconductor one-wire CRC
*
*************************************************************************/
short CalcDSRxChecksum16552(char ch) {

    short cnt;
    unsigned char csum;

    csum = 0;
    for (cnt = 0; cnt < (UART16552[ch].RxPacklen - 2); cnt++) {
        csum = crc[csum ^ UART16552[ch].pRxBuffer[cnt]];
    }
    if (csum == UART16552[ch].pRxBuffer[UART16552[ch].RxPacklen - 2]) {
        return true;
    } else {
        return false;
    }
}

/*************************************************************************
*
* Goes to sync mode
*
*************************************************************************/
void GoToSyncUART16552(char ch) {

    if (ch < 2) {
        UART16552[ch].SyncCnt = 0;                        // ready for sync
        UART16552[ch].RxState = SYNC;
        UART16552[ch].RxFirst = 0;
        UART16552[ch].RxPacklen = 0;
    }
}

/*************************************************************************
*
*  Empty rx buffer on PC16552 UART
*
*************************************************************************/
void EmptyRxBuf16552(char uartno) {

    switch (uartno) {
    case 0:
        do {
            U0_RBR;
        } while (U0_LSR & DATA_READY);
        break;
    case 1:
        do {
            U1_RBR;
        } while (U1_LSR & DATA_READY);
        break;
    }
}

/*************************************************************************
*
*  Init the PC16552 UART
*
*************************************************************************/
void Init16552(char channel, unsigned long baud) {

    /*--- Configure UART data block ---*/
    UART16552[channel].TxFirst = 0x00;
    UART16552[channel].TxLast = 0x00;
    UART16552[channel].TxCount = 0x00;
    UART16552[channel].RxFirst = 0x00;
    UART16552[channel].RxLast = 0x00;
    UART16552[channel].RxCount = 0x00;
    UART16552[channel].RxState = SYNC;
    UART16552[channel].SyncCnt = 0;
    UART16552[channel].TxStatus = 0x00;

    switch (channel) {
    case 0x00 :
        UART16552[channel].RxTimeout = RX_TO_TIME;   // reset timeout
        UART16552[channel].pTxBuffer = TxBuf16552Ch0;
        UART16552[channel].pRxBuffer = RxBuf16552Ch0;
        U0_LCR = 0x80;          // set DLAB
        U0_DLL = ((XTAL_CPU / 8 / 16 / baud) & 0xff);
        U0_DLM = (((XTAL_CPU / 8 / 16 / baud) >> 8) & 0xff);
        U0_LCR = 0x03;          // reset DLAB and set 8,n,1
        U0_FCR = 0x01;          // enable FIFO ..
        U0_FCR = 0xC1;          // and set RXLevel to 14
        U0_IER = 0x03;          // enable TX and RX int.
        U0_MCR = 0x00;          // RTS off
        break;
    case 0x01 :
        UART16552[channel].RxTimeout = RX_TO_TIME;   // reset timeout
        UART16552[channel].pTxBuffer = TxBuf16552Ch1;
        UART16552[channel].pRxBuffer = RxBuf16552Ch1;
        U1_LCR = 0x80;          // set DLAB
        U1_DLL = ((XTAL_CPU / 8 / 16 / baud) & 0xff);
        U1_DLM = (((XTAL_CPU / 8 / 16 / baud) >> 8) & 0xff);
        U1_LCR = 0x03;          // reset DLAB and set 8,n,1
        U1_FCR = 0x01;          // enable FIFO ..
        U1_FCR = 0xC1;          // and set RXLevel to 14
        U1_IER = 0x03;          // enable TX and RX int.
        U1_MCR = 0x00;          // RTS off
        break;
    default:
        break;
    }
}
